labs/scenariolab/loadgen/test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PerfLab" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="PerfLab Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(perf.threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(perf.duration_seconds,1)}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Bind PERF_* environment" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="script"><![CDATA[
import java.net.URI
def joinGeneratorPath = { String basePath, String scenario ->
  if (scenario == null || scenario.trim().isEmpty()) {
    scenario = "/"
  }
  def q = scenario.indexOf('?')
  def h = scenario.indexOf('#')
  def cut = -1
  if (q >= 0 && h >= 0) {
    cut = Math.min(q, h)
  } else if (q >= 0) {
    cut = q
  } else if (h >= 0) {
    cut = h
  }
  def pathOnly = cut >= 0 ? scenario.substring(0, cut) : scenario
  def suffix = cut >= 0 ? scenario.substring(cut) : ""
  def left = (basePath ?: "").replaceAll('/+$', '')
  def right = pathOnly.replaceAll('^/+', '')
  def joined
  if (left.isEmpty() && right.isEmpty()) {
    joined = "/"
  } else if (left.isEmpty()) {
    joined = "/" + right
  } else if (right.isEmpty()) {
    joined = left
  } else {
    joined = left + "/" + right
  }
  joined = joined.replaceAll('/+', '/')
  if (!joined.startsWith('/')) {
    joined = "/" + joined
  }
  return joined + suffix
}
def raw = System.getenv("PERF_BASE_URL")
if (raw == null || raw.trim().isEmpty()) {
  throw new Exception("PERF_BASE_URL is required")
}
def uri = URI.create(raw)
def scenario = System.getenv("PERF_PATH") ?: "/"
def method = (System.getenv("PERF_METHOD") ?: "GET").toUpperCase()
vars.put("perf.scheme", uri.getScheme() ?: "http")
vars.put("perf.host", uri.getHost())
def port = uri.getPort()
if (port < 0) {
  port = "https".equalsIgnoreCase(uri.getScheme()) ? 443 : 80
}
vars.put("perf.port", String.valueOf(port))
vars.put("perf.path", joinGeneratorPath(uri.getRawPath() ?: "", scenario))
vars.put("perf.method", method)
vars.put("perf.body", System.getenv("PERF_BODY") ?: "")
def headersRaw = System.getenv("PERF_HEADERS")
vars.put("perf.authorization", "")
if (headersRaw != null && !headersRaw.trim().isEmpty()) {
  try {
    def parsed = new groovy.json.JsonSlurper().parseText(headersRaw)
    if (parsed instanceof Map && parsed.Authorization) {
      vars.put("perf.authorization", String.valueOf(parsed.Authorization))
    }
  } catch (Exception ignored) {
  }
}
// perflab-baggage-v1 (D-P1-8): the request's run and phase as W3C baggage, so the
// application stamps them on its spans, logs and request metrics. A value the
// application would reject is not sent.
def baggageRunId = System.getenv("PERF_RUN_ID") ?: ""
def baggagePhase = props.get("perf.phase") ?: (System.getenv("PERF_PHASE") ?: "")
def baggageMembers = []
if (baggageRunId ==~ /[A-Za-z0-9._:-]{1,128}/) { baggageMembers << "perf.run.id=" + baggageRunId }
if (["warmup", "measure", "diagnostic"].contains(baggagePhase)) { baggageMembers << "perf.phase=" + baggagePhase }
vars.put("perf.baggage", baggageMembers.join(","))
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="PerfLab Headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">baggage</stringProp>
              <stringProp name="Header.value">${perf.baggage}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">${perf.authorization}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="PerfLab HTTP" enabled="true">
          <stringProp name="HTTPSampler.domain">${perf.host}</stringProp>
          <stringProp name="HTTPSampler.port">${perf.port}</stringProp>
          <stringProp name="HTTPSampler.protocol">${perf.scheme}</stringProp>
          <stringProp name="HTTPSampler.path">${perf.path}</stringProp>
          <stringProp name="HTTPSampler.method">${perf.method}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${perf.body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Stable v1 arrival pacing" enabled="true">
          <stringProp name="throughput">${__groovy(((props.get('perf.profile') ?: '') ==~ /open|arrival|capacity|knee/) ? ((props.get('perf.target_rps') ?: '1') as double) * 60 : 600000000)}</stringProp>
          <intProp name="calcMode">4</intProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>